## Terraform Plan

### Cluster: `retail`

```hcl

Error: Error acquiring the state lock

Error message: writing
"gs://fabled-citadel-482020-i0-tf-state/clusters/retail/default.tflock"
failed: googleapi: Error 412: At least one of the pre-conditions you
specified did not hold., conditionNotMet
Lock Info:
  ID:        1767471411390790
  Path:      gs://fabled-citadel-482020-i0-tf-state/clusters/retail/default.tflock
  Operation: OperationTypeApply
  Who:       runner@runnervmh13bl
  Version:   1.6.0
  Created:   2026-01-03 20:16:51.305204141 +0000 UTC
  Info:      


Terraform acquires a state lock to protect the state from being written
by multiple users at the same time. Please resolve the issue above and try
again. For most commands, you can disable locking with the "-lock=false"
flag, but this is not recommended.
::error::Terraform exited with code 1.

```

### Cluster: `test-cluster`

```hcl
          = (known after apply)
      + location                                 = "us-central1-a"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "test-cluster"
      + network                                  = "default"
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = (known after apply)
      + remove_default_node_pool                 = true
      + resource_labels                          = {
          + "environment" = "dev"
          + "managed-by"  = "terraform"
          + "team"        = "testing"
        }
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "default"
      + tpu_ipv4_cidr_block                      = (known after apply)

      + workload_identity_config {
          + workload_pool = "fabled-citadel-482020-i0.svc.id.goog"
        }
    }

  # module.gke_cluster.google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "test-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "test-cluster-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "fabled-citadel-482020-i0"
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = 30
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "environment" = "dev"
              + "managed-by"  = "terraform"
              + "team"        = "testing"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "e2-small"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "testing",
              + "dev",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_name            = "test-cluster"
  + cluster_zone            = "us-central1-a"
  + get_credentials_command = "gcloud container clusters get-credentials test-cluster --zone us-central1-a --project fabled-citadel-482020-i0"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

